Repository: mithem/GLapp
Catalog: GLapp/localization/*/*.lproj/Localizable.strings
Languages: de

source: Username
de: Benutzername

source: Password
de: Passwort

source: Send
de: Absenden

# note_all_traffic_encrypted
source: All traffic is sent over an encrypted connection.
de: Jegliche Daten werden über eine verschlüsselte Verbindung übertragen.

# error_submitting_login_information_returning_data
source: Submitting login information falsely returned data.
de: Das Übertragen der Logininformationen hat fälschlicherweise Daten zurückgegeben.

# error_colon
source: Error:
de: Fehler:

source: Error occured
de: Fehler aufgetreten

source: Not authorized.
de: Nicht authorisiert.

source: No data.
de: Keine Daten verfügbar.

source: Bad request.
de: Fehlerhafte Anfrage.

source: unknown error.
de: Unbekannter Fehler.

source: Settings
de: Einstellungen

source: Timetable
de: Stundenplan

source: Class tests
de: Klausurplan

source: Representative plan
de: Vertretungsplan

source: Reset all data
de: Alle Daten zurücksetzen

# invalid_response
source: Invalid server response.
de: Ungültige Server-Antwort.

source: No XML root element.
de: Kein XML Root-Element.

source: Invalid XML root element.
de: Ungültiges XML Root-Element.

# no_timestamp
source: No timestamp given.
de: Kein Zeitpunkt angegeben.

# invalid_timestamp
source: Invalid timestamp given.
de: Ungültiger Zeitpunkt angegeben.

# representative_plan_empty
source: The representative plan is empty.
de: Der Vertretungsplan ist leer.

# classTestPlan_empty
source: There are no class tests scheduled.
de: Es stehen keine Klausuren an.

# timetable_empty
source: There's no timetable available.
de: Es ist kein Stundenplan verfügbar.

source: Retry
de: Erneut versuchen

# mobile_key_not_configured
source: No login data configured.
de: Keine Anmeldedaten hinterlegt.

source: Teacher
de: Lehrer

# date_colon %@
source: Date: %@
de: Stand: %@

source: Sometime
de: Irgendwann

# loading_msg
source: Loading...
de: Laden...

source: Notes
de: Informationen

# check_for_functionality
source: Check functionality
de: Funktionalität prüfen

source: Functionality check
de: Funktionalitätscheck

# feature_notifications_title
source: Notifications
de: Benachrichtigungen

# feature_notifications_description
source: Send notifications.
de: Benachrichtigungen versenden.

# feature_background_refresh_title
source: Background refresh
de: Hintergrundaktualisierung

# feature_background_refresh_description
source: Execute tasks while GLapp is in background.
de: Im Hintergrund Aufgaben ausführen.

# feature_background_repr_plan_notifications_title
source: Automatic notifications when representative plan changes
de: Automatische Benachrichtigung bei Vertretungsplanänderungen

# feature_background_repr_plan_notifications_description
source: Check for updated representative plan in background.
de: Im Hintergrund auf aktualisierten Vertretungsplan prüfen.

# feature_class_test_reminders_title
source: Class test reminders
de: Klausurerinnerungen

# feature_class_test_reminders_description
source: Get reminders at predefined intervals before class tests.
de: Vor Klausuren zu einem vordefinierten Zeitpunkt eine Erinnerung erhalten.

# feature_colored_inline_subjects_title
source: Color subjects
de: Fächer einfärben

# feature_calendar_access_title
source: Calendar access
de: Kalendarzugriff

# feature_calendar_access_description
source: Allow GLapp to save calendar events.
de: GLapp erlauben, Kalendareinträge zu sichern.

# feature_class_test_calendar_events_title
source: Class test events
de: Klausuren in Kalendar eintragen

# feature_class_test_calendar_events_description
source: Automatically create calendar events for class tests.
de: Automatische Erstellung von Kalendareinträgen für Klausuren.

# feature_class_test_plan_title
source: Class test plan
de: Klausurplan

# feature_spotlight_integration_description
source: Make content searchable for the system.
de: Inhalt für das System durchsuchbar machen.

# feature_time_sensitive_notifications_title
source: Time sensitive notifications
de: Dringliche Mitteilungen

# feature_time_sensitive_notifications_description
source: Let notifications break through focus (without overriding the ring/silent switch).
de: Benachrichtigungen können den Fokus durchbrechen (ohne den Lautstärkeschalter zu umgehen).

# feature_authentication_title
source: Authentication
de: Authentifizierung

# feature_authentication_description
source: User authentication using the secure enclave on your device.
de: Benutzerauthentifizierung mittels der Secure Enclave auf dem Gerät.

source: Enable
de: Aktivieren

source: Upcoming
de: Anstehend

source: Clear cache
de: Cache leeren

source: Last fetched:
de: Zuletzt aktualisiert:

source: Upcoming class test
de: Anstehende Klausur

source: Set reminder
de: Erinnerung setzen

source: Reset onboarding
de: Onboarding zurücksetzen

# repr_plan_update
source: Representative plan update
de: Update des Vertretungsplans

source: More
de: Mehr

# fs_error_no_url
source: Filesystem: no URL given.
de: Dateisystem: keine URL angegeben

source: Done
de: Fertig

source: Color
de: Farbe

# subject_name
source: Subject
de: Fach

source: Subject type
de: Kursart

# class_test_plan_not_supported
source: Class test plan not supported. Applies to Secondary stage I.
de: Klausurplan nicht unterstützt. Betrifft Sekundarstufe I.

source: Room
de: Raum

# auto_remind_before_class_tests
source: Automatically remind before class tests
de: Vor Klausuren automatisch erinnern

# remind_n_days_before_class_tests_colon
source: Remind days before class tests:
de: Tage vor Klausuren erinnern:

source: Data management
de: Datenverwaltung

source: Reload all
de: Alles aktualisieren

source: Reload timetable
de: Stundenplan aktualisieren

source: Reload class tests
de: Klausurplan aktualisieren

source: Reload representative plan
de: Vertretungsplan aktualisieren

# keyboard_shortcut_reload_timetable
source: T
de: S

# keyboard_shortcut_reload_class_test_plan
source: C
de: K

# keyboard_shortcut_reload_representative_plan
source: R
de: V

# functionality_error_not_supported
source: The feature isn't supported in the current configuration:
de: Das Feature wird in der derzeitigen Konfiguration nicht unterstützt:

source: misconfigured
de: miskonfiguriert

# user_credentials_empty
source: Login information empty
de: Logininformationen leer

# user_credentials_empty_activate_demo_mode
source: Enable demo mode?
de: Demomodus aktivieren?

source: Demo mode active.
de: Demomodus aktiv.

# with_mid_sentence
source: with
de: bei

source: Show scheduled notifications
de: Geplante Benachrichtigungen anzeigen

source: Scheduled notifications
de: Geplante Benachrichtigungen

source: No scheduled notifications.
de: Keine Benachrichtigungen geplant.

source: Advanced settings
de: Fortgeschrittene Einstellungen

source: Test notification
de: Test-Benachrichtigung

# repr_plan_notifications_high_relevance_explanation
source: Maximum distance in time of a representative plan notification to the corresponding lesson making the notification being marked as relevant. This results in it being sent as a time-sensitive notification and being prioritized in notification center.
de: Maximaler zeitlicher Abstand einer Vertretungsplanbenachrichtigung von einer Vertretungsstunde, um als relevant gewertet zu werden. Dann werden Mitteilungen als dringlich bewertet und erscheinen priorisiert in der Mitteilungszentrale.

# repr_plan_notifications_send_entire_repr_plan
source: Send entire repr. plan in notifications
de: Gesamten Vertr.-plan in Benachr. senden

# repr_plan_notifications_send_entire_repr_plan_explanation
source: Send the entire representative plan in notifications instead of just the updates (which only includes additions/changes to the plan, not removals).
de: Bei Vertretungsplanänderungen nicht nur die jeweiligen Änderungen (Ergänzungen/Änderungen, nicht Löschungen) versenden, sondern den gesamten Vertretungsplan.

source: Notifications are disabled.
de: Benachrichtigungen deaktiviert.

# suggestion_ShowTimetableIntent
source: Show timetable
de: Zeige den Stundenplan

# suggestion_ShowClassTestPlanIntent
source: Show class test plan
de: Zeige den Klausurplan

# suggestion_ShowRepresentativePlanIntent
source: Show representative plan
de: Zeige den Vertretungsplan

source: Invalid URL.
de: Ungültige URL.

# dont_save_repr_plan_update_timestamp_when_viewing_app
source: Always deliver representative plan notifications
de: Vertretungsplanbenachrichtigungen immer zustellen

# dont_save_repr_plan_update_timestamp_when_viewing_app_explanation
source: Deliver representative plan update notifications even after viewing the plan in-app.
de: Vertretungsplanbenachrichtigungen auch dann noch zustellen, nachdem der Plan bereits innerhalb der App gesichtet wurde.

source: Request provisional notification permission
de: Provisorische Benachrichtigen aktivieren

source: Currently enabled
de: Derzeit aktiviert

source: Currently disabled
de: Derzeit deaktiviert

source: unknown state
de: Unbekannter Zustand

source: Semi-enabled state
de: Zwischenzustand

source: Permission provisional or ephemeral
de: Berechtigung provisorisch oder ephemerisch

source: Current repr. plan
de: Aktueller Vertretungsplan

source: Low power mode enabled
de: Stromsparmodus aktiviert

source: Regenerate colors
de: Farben regenerieren

# class_test_mid_sentence
source: class test
de: Klausur

source: representative lesson
de: Vertretungsstunde

source: substitution lesson
de: Ersatzstunde

source: substitution plan
de: Ersatzplan

source: lesson
de: Stunde

source: Color coding error
de: Farbver- oder Entschlüsselungsfehler

source: Cancel
de: Abbrechen

# invalid_with_advice
source: Invalid. Check somewhere reliable.
de: Ungültig. Bitte eine zuverlässige Quelle überprüfen.

# repr_plan_contains_invalid_lessons_title
source: Repr. plan contains invalid lessons
de: Vertretungsplan enthält ungültige Stunden.

# repr_plan_contains_invalid_lessons_description
source: This is an error occurring with the school system. Interner Bereich may also show invalid data.
de: Dies ist ein Fehler, der im Schulsystem auftritt. Der Interne Bereich könnte ebenfalls ungültige Daten zeigen.

source: Open interner Bereich
de: Internen Bereich öffnen

# class_test_reminder_time_mode_at_class_test_time
source: At class test time
de: Relativ zu Klausurbeginn

# class_test_reminder_time_mode_manual
source: Manual
de: Manuell

# class_test_reminder_time_manual_time
source: Manual delivery time
de: Manuelle Zustellzeit

source: Reset preferences
de: Einstellungen zurücksetzen

source: General
de: Allgemein

source: Class test reminders
de: Klausurerinnerungen

# background_check_minimum_time_interval_explanation
source: Minimum time interval the system can schedule a representative plan background check after.
de: Minimales Zeitintervall, zu dem das System die Hintergrundaktualisierung des Vertretungsplans vornehmen kann.

source: App locked.
de: App gesperrt.

source: Unlock
de: Entsperren

source: What's new
de: Neues

source: New
de: Neu

source: Improved
de: Verbessert

source: Fixed
de: Behoben

source: Show feature promo
de: Feature-Promo anzeigen

source: Support for user authentication (passcode, TouchID, FaceID)
de: Support für Authentifizierung (Passcode, TouchID, FaceID)

# better_notifications_of_repr_plan
source: Better notifications of representative plan.
de: Bessere Vertretungsplanbenachrichtigungen

source: Some settings not reloading
de: Manche Einstellungen aktualisierten sich nicht umgehend

# e_support_for_up_to_19_lessons_a_day
source: 📆 Support for up to 19 lessons a day
de: 📆 Support für bis zu 19 Stunden pro Tag

source: More resilience when parsing timetable
de: Robusteres Parsen des Stundenplans

source: Optimizations for binary size
de: Optimierungen zur Größe der Binärdatei

# e_typos
source: ✍️ typos
de: ✍️ Tippfehler

source: Support for Shortcuts (app)
de: Support für Kurzbefehle

source: Shortcuts for repr. plan, timetable and class test plan
de: Kurzbefehle für den Vertretungsplan, Stundenplan sowie Klausurplan

source: Support for Spotlight
de: Support für Spotlight

source: Data will be indexed on device
de: Daten werden auf dem Gerät verarbeitet.

source: Close
de: Schließen

# notes_attention
source: Notes
de: Hinweise

# version_update_promos
source: Version update promotions
de: Vorstellungen für Versionsupdates

source: Functionality check still available manually.
de: Funktionalitätsprüfung weiterhin manuell verfügbar

source: Even more resilience when parsing timetable
de: Noch mehr Robustheit beim Parsen des Stundenplans

# discard_invalid_repr_lessons_in_notifications
source: Discard invalid representative lessons in notifications
de: Keine ungültigen Vertretungsstunden in Vertretungsplanbenachrichtigungen versenden

# e_support_for_up_to_12_lessons_a_day
source: 📆 Support for up to 12 lessons a day
de: 📆 Support für bis zu 12 Stunden pro Tag

# auto_settings_repair_mechanism
source: Auto-repair mechanism for settings
de: Automatischer Reparierungs-Mechanismus für ungültige Einstellungen

source: More resilience when parsing data
de: Mehr Robustheit beim Parsen von Daten

# show_data_for_invalid_repr_lessons
source: Show data for representative lessons, even if they are invalid.
de: Anzeigen von allen Daten auch ungültiger Vertretungsstunden

source: Additional information on repr. plan being parsed
de: Parsen zusätzlicher Informationen vom Vertretungsplan

# option_for_choosing_minimal_time_interval_between_repr_plan_checks
source: Option for choosing minimal time interval between representative plan checks
de: Option zur Anpassung des minimalen Zeit-Intervalls zwischen Vertretungsplanhintergrundüberprüfungen

source: Recreate demo events
de: Rekreieren von Demo-Kalendareinträge

source: Delete demo events when deactivating demo mode
de: Demo-Kalendareinträge löschen, sobald Demo-Modus deaktiviert wird

source: No demo event duplication
de: Keine Demo-Kalendareintragsduplikationen

source: Option to always deliver class test reminders at a fixed manually configurable time
de: Option, Klausurerinnerungen immer zu einem manuell konfigurierbaren Zeitpunkt zu erhalten

source: Button to reset preferences
de: Knopf zum Zurücksetzen der Einstellungen

source: Separate views for general and class test reminder related settings
de: Getrennte Ansichten für allgemeine und klausurerinnerungsbezogene Einstellungen

source: Show functionality check on appropriate app update
de: Anzeigen des Funktionalitätschecks bei angebrachten App-Updates

source: Reset app data when downgrading as a precaution
de: Zurücksetzen aller Daten bei Downgrade (als Vorsichtsmaßnahme)

source: Increase relative precision when showing time interval until class test that's not far away
de: Relative Präzision des zeitlichen Abstands zu Klausur, die nicht mehr "weit entfernt" ist, erhöhen

source: Haptic feedback when changing stepper values
de: Haptisches Feedback beim Ändern von Steppern

source: Don't trigger haptic feedback when launching app
de: Kein haptisches Feedback beim Start der App

source: Grey out passed class tests
de: Ausgrauen vergangener Klausuren

source: More precise countdown for upcoming class tests
de: Präziserer Countdown für anstehende Klausuren

source: Option for adjusting the time interval required for a representative lesson to be of high relevance
de: Option, um das Zeitintervall anzupassen, das für eine Vertretungsstunde hoher Relevanz erforderlich ist

source: Integrate user activity into system
de: Integrieren der Benutzeraktivität in das System

# option_to_disable_saving_last_repr_plan_update_timestamp
source: Option to disable saving last representative plan update timestamp
de: Option, das Speichern des letzten Vertretungsplancheckzeitpunkts zu unterbinden

source: Log in button in settings when not logged in
de: Log-In Knopf, falls ausgeloggt

source: Support for Spotlight (optional)
de: Support für Spotlight (optional)

source: Button to regenerate colors
de: Knopf zum regenerieren der Farben

source: Add explainer for notification relevance system
de: Hinzufügen eines Erklärers für das Benachrichtungs-Relevanz-System

# only_repr_plan_updates_sent_via_notifications
source: Only representative plan updates sent via notifications
de: Ausschließliches Senden von Vertretungsplanänderungen via Benachrichtigungen

source: Support for provisional or ephemeral notifications (requested on first launch)
de: Support für provisorische & kurzlebige Benachrichtigungen (Anfrage beim ersten Start)

# show_changelog_when_updating_versions_feature_updates_only
source: Show changelog after updating versions (feature updates only)
de: Zeigen des Changelogs nach Updates (ausschließlich Feature-Updates)

source: Force-ask for notification permissions when enabling features requiring notifications and provisional ones are enabled
de: Zwingendes Erfragen von Benachrichtungserlaubnis beim Aktivieren von Features, die Benachrichtigungen benötigen, falls provisorische oder kurzlebige Benachrichtungen aktiviert sind

source: More robust data saving
de: Robusteres Speichern von Daten

source: Detect semi-enabled functionalities
de: Erfassen semi-aktivierter Funktionen

# add_more_context_menu_to_repr_lessons
source: Add 'more' context menu to representative lessons
de: Extra 'mehr' Kontext-Menu für Vertretungsstunden

source: Notifications being scheduled without time sensitivity regardless of relevance
de: Benachrichtigungen wurden ohne Dringlichkeit zugestellt, unabhängig von deren Relevanz

source: UI irregularities, esp. for secondary stage I
de: UI Unregelmäßigkeiten, besonders hinsichtlich Sekundarstufe I

source: Sync class test subjects with timetable
de: Synchronisieren von Klausurfächern mit Stundenplan

source: Crashes
de: Abstürze

source: This update removes support for iPadOS multiple windows.
de: Dieses Update entfernt Support für mehrere Fenster unter iPadOS

source: Automatic reloading of data changed in background
de: Automatisches Aktualisieren von geladenen Daten im Hintergrund

source: Disorganized colors of timetable on first launch
de: Chaotische Fachfarben im Stundenplan beim ersten App-Start

source: Handling of server errors
de: Umgang mit Server-Fehlern

source: Keyboard shortcuts for navigating in iPadOS
de: Keyboard shortcuts zum Navigieren in iPadOS

# indication_in_tab_bar_icon_when_repr_plan_has_items
source: Indication in tab bar icon when representative plan has items
de: Indikation im Tab Bar Icon, falls der Vertretungsplan gefüllt ist

source: Option to automatically add class tests to calendar
de: Option, Klausuren automatisch zum Kalendar hinzuzufügen

# option_for_class_tests_and_repr_lessons_to_use_subject_color
source: Option for class tests and representative lessons to use subject color
de: Option, dass Klausuren & Vertretungsstunden in der Fachfarbe eingefärbt werden

source: Optimizations for secondary stage I
de: Optimisierungen für Sekundarstufe I

source: Tweak colors for better readability for all appearances
de: Anpassen der Farben für bessere Lesbar mit allen Erscheinungsformen

source: Show notifications even when app is in foreground
de: Anzeigen von Benachrichtigungen auch wenn die App im Vordergrund ist

source: Give feedback when certain functionality can't be enabled
de: Feedback, falls eine Funktion nicht aktiviert werden kann

source: Remove delivered class test reminders only after class test is over
de: Entfernen von Klausurbenachrichtungen erst nach der jeweiligen Klausur

# repr_plan_updates_being_sent_out_constantly
source: Representative plan updates being sent out constantly
de: Ständige Zustellunge von Vertretungsplanbenachrichtungen

# not_localized_repr_plan_update_title
source: Not localized 'repr_plan_update' title for notifications
de: Nicht lokalisierter 'repr_plan_update' Titel für Vertretungsplanbenachrichtigungen

# no_color_for_rewrite_class_tests
source: Color for rewrite class tests
de: Farbe für Nachschriften

source: Navigation not working on iPadOS in split screen
de: Navigation im iPadOS Split-Screen nicht funktional

source: UI for large dynamic type sizes with little screen real estate
de: UI-Fixes für erhöhte Dynamic Type-Größen mit wenig vorhandenem Platz

# initial_release_e!_thanks_for_downloading!
source: Intial release 🚀! Thanks for downloading!
de: Erstes Release 🚀! Danke für's Downloaden!

source: Detailed changelog over all versions
de: Detaillierter Changelog für alle Versionen

source: Navigation keyboard shortcuts
de: Keyboard shortcuts für Navigation

source: For navigating in-app
de: Zum Navigieren innerhalb der App

source: Indication in tab bar icon
de: Indikation im Tab Bar Icon

# only_shows_when_repr_plan_has_items
source: Only shows when representative plan has items
de: Nur sichtbar, wenn Vertretungsplan gefüllt ist

source: Color subjects
de: Fächer einfärben

source: Color text in subject color
de: Font in Fachfarben einfärben (sorry)

source: Showing on each relevant app update
de: Anzeige nach jedem relevanten App-Update
