Repository: mithem/GLapp
Catalog: GLapp/shared/Intents/*.lproj/Intents.strings
Languages: de

# Aemakq
source: Open the representative plan in GLapp.
de: Den Vertretungsplan in GLapp anzeigen.

# OqmJOO
source: Show timetable
de: Stundenplan öffnen

# P37F8G
source: Show class test plan
de: Klausurplan öffnen

# PY3055
source: Show representative plan
de: Vertretungsplan öffnen

# TeKeqF
source: Show representative plan
de: Vertretungsplan öffnen

# W2Rzxb
source: Show class test plan
de: Klausurplan öffnen

# XbRahk
source: Show class test plan
de: Klausurplan öffnen

# nahZwv
source: Show timetable
de: Stundenplan öffnen

# o7S4Zy
source: Open the timetable in GLapp.
de: Den Stundenplan in GLapp anzeigen.

# oIXNaH
source: Show timetable
de: Stundenplan öffnen

# t2FHMJ
source: Open the class test plan in GLapp.
de: Den Klausurplan in GLapp anzeigen.

# wggxCu
source: Show representative plan
de: Vertretungsplan öffnen
